lopple/ch32fun/minichlink/pgm-b003fun.c
#include <stdint.h>
#include "hidapi.h"
#include "minichlink.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "chips.h"
#include "../ch32fun/ch32fun.h"

// #define DEBUG_B003

#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
void Sleep(uint32_t dwMilliseconds);
uint32_t GetTickCount(void);
#define usleep( x ) Sleep( x / 1000 )
#define sleep( x ) Sleep( x * 1000 )
#else
#include <time.h>
#include <unistd.h>
#endif

#define MAX_USB_ERR 10000
#define TERMINAL_FEATURE_ID 0xFD
#define B003FUN_FAST_TEST_VIDPID 0x1209000a
#define B003FUN_FAST_USER_VIDPID 0x1209c003
#define B003FUN_CRC32_LOADER_ADDR 0x20000500
#define B003FUN_CRC32_PARAM_OFFSET 32
#define B003FUN_CRC32_RESULT_OFFSET 56

struct B003FunProgrammerStruct
{
	void * internal; // Part of struct ProgrammerStructBase 
	hid_device * hd;
	uint8_t commandbuffer[8196];
	uint8_t respbuffer[8196];
	int commandplace;
	int long_op;
	int no_get_report;
	int err_count;
	int scratchpad_size;
	int scratchpad_data_size;
	int no_eight_byte;
	int fixed_report_size;
	int crc32_loader_uploaded;
	int send_retry_delay_us;
};

static hid_device * B003FunOpenUserVendorInterface( uint32_t * attempts_out, int poll_ms, int timeout_ms );

static int B003FunEnvInt( const char * name, int default_value, int min_value, int max_value )
{
	const char * value = getenv( name );
	if( !value || !value[0] ) return default_value;

	char * endptr = 0;
	long parsed = strtol( value, &endptr, 0 );
	if( endptr == value ) return default_value;
	if( parsed < min_value ) parsed = min_value;
	if( parsed > max_value ) parsed = max_value;
	return (int)parsed;
}

static int B003FunEnvEnabledDefault( const char * name, int default_value )
{
	const char * value = getenv( name );
	if( !value || !value[0] ) return default_value;
	return strcmp( value, "0" );
}

static int B003FunTimingEnabled()
{
	const char * timing = getenv( "MINICHLINK_TIMING" );
	return timing && timing[0] && strcmp( timing, "0" );
}

static uint64_t B003FunTimingNowMS()
{
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
	return GetTickCount();
#else
	struct timespec ts;
	clock_gettime( CLOCK_MONOTONIC, &ts );
	return (uint64_t)ts.tv_sec * 1000 + (uint64_t)( ts.tv_nsec / 1000000 );
#endif
}

static void B003FunTimingPrint( const char * name, uint64_t start_ms )
{
	if( B003FunTimingEnabled() )
	{
		printf( "timing_b003fast_%s_ms=%llu\n", name, (unsigned long long)( B003FunTimingNowMS() - start_ms ) );
	}
}

static void B003FunTimingPrintCount( const char * name, uint32_t count )
{
	if( B003FunTimingEnabled() )
	{
		printf( "b003fast_%s=%u\n", name, count );
	}
}

static void B003FunRetryDelayUS( int us )
{
	if( us <= 0 ) return;
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
	Sleep( (uint32_t)( ( us + 999 ) / 1000 ) );
#else
	usleep( us );
#endif
}

static const unsigned char byte_wise_read_blob[] = { // No alignment restrictions.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x94, 0x21, 0x14, 0xa3, 0x85, 0x05, 0x05, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char half_wise_read_blob[] = {  // size and address must be aligned by 2.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x96, 0x21, 0x16, 0xa3, 0x89, 0x05, 0x09, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char word_wise_read_blob[] = { // size and address must be aligned by 4.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x94, 0x41, 0x14, 0xc3, 0x91, 0x05, 0x11, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char word_wise_write_blob[] = { // size and address must be aligned by 4.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x43, 0x94, 0xc1, 0x91, 0x05, 0x11, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80, // NOTE: No readback!
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
/*
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x43, 0x94, 0xc1, 0x94, 0x41, 0x14, 0xc3, // With readback.
	0x91, 0x05, 0x11, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 */
};

static const unsigned char call_crc32[] = {
	0x13, 0x07, 0x05, 0x02, 0x0c, 0x43, 0x50, 0x43, 0x14, 0x47, 0x82, 0x86,
};

static const unsigned char ram_crc32[] = {
	0x7d, 0x57, 0x37, 0x83, 0xb8, 0xed, 0x13, 0x03, 0x03, 0x32, 0x15, 0xc2,
	0x83, 0xc7, 0x05, 0x00, 0x3d, 0x8f, 0xa1, 0x42, 0x93, 0x73, 0x17, 0x00,
	0x05, 0x83, 0x63, 0x84, 0x03, 0x00, 0x33, 0x47, 0x67, 0x00, 0xfd, 0x12,
	0xe3, 0x98, 0x02, 0xfe, 0x85, 0x05, 0x7d, 0x16, 0x65, 0xf2, 0xfd, 0x56,
	0x35, 0x8f, 0x93, 0x07, 0x85, 0x03, 0x98, 0xc3, 0x14, 0xc1, 0x82, 0x80,
};
static const unsigned char write64_flash[] = { // size and address must be aligned by 4.
	0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x13, 0x86, 0x05, 0x04, 0x5c, 0x43,
	0x8c, 0xc7, 0x14, 0x47, 0x94, 0xc1, 0xb7, 0x06, 0x05, 0x00, 0xd4, 0xc3,
	0x94, 0x41, 0x91, 0x05, 0x11, 0x07, 0xe3, 0xc8, 0xc5, 0xfe, 0xc1, 0x66,
	0x93, 0x86, 0x06, 0x04, 0xd4, 0xc3, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80
};

static const unsigned char half_wise_write_blob[] = { // size and address must be aligned by 2
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x16, 0x23, 0x96, 0xa1, 0x96, 0x21, 0x16, 0xa3,
	0x89, 0x05, 0x09, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char byte_wise_write_blob[] = { // no division requirements.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x23, 0x94, 0xa1, 0x94, 0x21, 0x14, 0xa3,
	0x85, 0x05, 0x05, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

// Just set the countdown to 0 to avoid any issues.
//   li a3, 0; sw a3, 0(a1); li a3, -1; sw a3, 0(a0); ret;
static const unsigned char halt_wait_blob[] = {
	0x81, 0x46, 0x94, 0xc1, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80 };

// Set the countdown to -1 to cause main system to execute.
//   li a3, -1; sw a3, 0(a1); li a3, -1; sw a3, 0(a0); ret;
//static const unsigned char run_app_blob[] = {
//	0xfd, 0x56, 0x94, 0xc1, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80 };
//
// Alternatively, we do it ourselves.

