lopple/ch32fun/minichlink/pgm-b003fun.c
// Run app blob (old):
// static const unsigned char run_app_blob[] = {
// 	0x37, 0x07, 0x67, 0x45, 0xb7, 0x27, 0x02, 0x40, 0x13, 0x07, 0x37, 0x12,
// 	0x98, 0xd7, 0x37, 0x97, 0xef, 0xcd, 0x13, 0x07, 0xb7, 0x9a, 0x98, 0xd7,
// 	0x23, 0xa6, 0x07, 0x00, 0x13, 0x07, 0x00, 0x08, 0x98, 0xcb, 0xb7, 0xf7,
// 	0x00, 0xe0, 0x37, 0x07, 0x00, 0x80, 0x23, 0xa8, 0xe7, 0xd0, 0x82, 0x80,
// };

// Run app blob (new):
static const unsigned char run_app_blob[] = {
	0xb7,0xf5,0xff,0x1f,  // li     a1,0x1FFFF000   - load offset to a1
	0x93,0x87,0xc5,0x77,  // addi   a5,a1,0x77C     - load absolute address of secret area to a5
	0x03,0xa7,0x07,0x00,  // lw     a4,0(a5)        - load reboot function offset + xor from secret to a4
	0x13,0x57,0x07,0x01,  // srli   a4,a4,16        - shift it to remove lower part (offset)
	0x83,0x96,0x07,0x00,  // lh     a3,0(a5)        - load offset part to a3
	0x93,0xc7,0xc6,0x77,  // xori   a5,a3,0x77C     - find current xor
	0x63,0x16,0xf7,0x00,  // bne    a4,a5,.L2       - if xor is valid
	0x33,0x87,0xb6,0x00,  // add    a4, a3, a1      - make absolute address of reboot function an jump
	0x67,0x00,0x07,0x00,  // jr     a4              - jump to it
	/* else - means that we didn't find a reboot function address
	and need to send the blob to do a reboot
.L2:                                                - Same sequence as in "Run app blob (old)"*/
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x87,0x02,  // addi   a5,a5,40
	0x37,0x07,0x67,0x45,  // li     a4,1164378112
	0x13,0x07,0x37,0x12,  // addi   a4,a4,291
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x87,0x02,  // addi   a5,a5,40
	0x37,0x97,0xef,0xcd,  // li     a4,-839938048
	0x13,0x07,0xb7,0x9a,  // addi   a4,a4,-1621
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0xc7,0x00,  // addi   a5,a5,12
	0x23,0xa0,0x07,0x00,  // sw     zero,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x07,0x01,  // addi   a5,a5,16
	0x13,0x07,0x00,0x08,  // li     a4,128
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0xf7,0x00,0xe0,  // li     a5,-536809472
	0x93,0x87,0x07,0xd1,  // addi   a5,a5,-752
	0x37,0x07,0x00,0x80,  // li     a4,-2147483648
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
};

// Interrupts enabled, no FLASH->ADDR loads
// unsigned char write_block_bin[] = {
// 	0x13, 0x07, 0x45, 0x05, 0x0c, 0x43, 0x5c, 0x43, 0x83, 0x12, 0x87, 0x00,
// 	0x03, 0x13, 0xa7, 0x00, 0x2e, 0x93, 0xb7, 0x06, 0x01, 0x00, 0xd4, 0xc3,
// 	0x33, 0x86, 0x55, 0x00, 0xb7, 0x06, 0x09, 0x00, 0xd4, 0xc3, 0x94, 0x41,
// 	0x54, 0x47, 0x94, 0xc1, 0xb7, 0x06, 0x05, 0x00, 0xd4, 0xc3, 0x94, 0x41,
// 	0x91, 0x05, 0x11, 0x07, 0xe3, 0xc8, 0xc5, 0xfe, 0xb7, 0x06, 0x01, 0x00,
// 	0x93, 0x86, 0x06, 0x04, 0xd4, 0xc3, 0x83, 0xa6, 0xc5, 0xff, 0xe3, 0xc9,
// 	0x65, 0xfc, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80
// };

// Interrupts disabled, no FLASH->ADDR loads
unsigned char write_block_bin[] = {
	0xf3, 0x27, 0x00, 0x30, 0x93, 0xf7, 0x77, 0xf7, 0x73, 0x90, 0x07, 0x30,
	0x13, 0x07, 0xc5, 0x06, 0x0c, 0x43, 0x5c, 0x43, 0x83, 0x12, 0x87, 0x00,
	0x03, 0x13, 0xa7, 0x00, 0x2e, 0x93, 0xb7, 0x06, 0x01, 0x00, 0xd4, 0xc3,
	0x33, 0x86, 0x55, 0x00, 0xb7, 0x06, 0x09, 0x00, 0xd4, 0xc3, 0x94, 0x41,
	0x54, 0x47, 0x94, 0xc1, 0xb7, 0x06, 0x05, 0x00, 0xd4, 0xc3, 0x94, 0x41,
	0x91, 0x05, 0x11, 0x07, 0xe3, 0xc8, 0xc5, 0xfe, 0xb7, 0x06, 0x01, 0x00,
	0x93, 0x86, 0x06, 0x04, 0xd4, 0xc3, 0x83, 0xa6, 0xc5, 0xff, 0xe3, 0xc9,
	0x65, 0xfc, 0xfd, 0x56, 0x14, 0xc1, 0xf3, 0x27, 0x00, 0x30, 0x93, 0xe7,
	0x87, 0x08, 0x73, 0x90, 0x07, 0x30, 0x82, 0x80
};

// unsigned char write_block_bin[] = {
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00,
	// 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0x01, 0x00, 0xfd, 0x56,
	// 0x14, 0xc1, 0x82, 0x80
// };

unsigned char erase_block_bin[] = {
	0x13, 0x07, 0x85, 0x03, 0x0c, 0x43, 0x5c, 0x43, 0x83, 0x12, 0x87, 0x00,
	0x03, 0x16, 0xa7, 0x00, 0x2e, 0x96, 0xb7, 0x06, 0x02, 0x00, 0xd4, 0xc3,
	0x93, 0x86, 0x06, 0x04, 0x8c, 0xc7, 0xd4, 0xc3, 0x98, 0x43, 0x05, 0x8b,
	0x75, 0xff, 0x96, 0x95, 0xe3, 0xca, 0xc5, 0xfe, 0xfd, 0x56, 0x14, 0xc1,
	0x01, 0x00, 0x82, 0x80
};

static void ResetOp( struct B003FunProgrammerStruct * eps )
{
	memset( eps->commandbuffer, 0, sizeof( eps->commandbuffer ) );
	memcpy( eps->commandbuffer, "\xaa\x00\x00\x00", 4 );
	eps->commandplace = 4;
}

static void WriteOp4( struct B003FunProgrammerStruct * eps, uint32_t opsend )
{
	int place = eps->commandplace;
	int newend = place + 4;
	if( newend < eps->scratchpad_size )
	{
		memcpy( eps->commandbuffer + place, &opsend, 4 );
	}
	eps->commandplace = newend;
}

static void WriteOpArb( struct B003FunProgrammerStruct * eps, const uint8_t * data, int len )
{
	int place = eps->commandplace;
	int newend = place + len;
	if( newend < eps->scratchpad_size )
	{
		memcpy( eps->commandbuffer + place, data, len );
	}
	eps->commandplace = newend;
}

static int CommitOp( struct B003FunProgrammerStruct * eps, int send_data_len, int receive_data_len )
{
	int retries = 0;
	int r;

	uint8_t feature_id = 0xaa;
	uint32_t magic_go = 0x1234abcd;
	uint32_t pad_size = eps->commandplace + send_data_len + 4;
	if( eps->fixed_report_size )
	{
		if( pad_size > (uint32_t)eps->fixed_report_size )
		{
			fprintf(stderr, "Error! Command buffer is bigger than fixed report size\n");
			return -10;
		}
		pad_size = (uint32_t)eps->fixed_report_size;
		memcpy( eps->commandbuffer + pad_size - 4, &magic_go, 4 );
		eps->commandbuffer[0] = feature_id;
	}
	else if ( pad_size <= eps->scratchpad_size )
	{
		if( pad_size > 5248 ) pad_size = 6272;
		else if( pad_size > 4096 ) pad_size = 5248;
		else if( pad_size > 3200 ) pad_size = 4096;
		else if( pad_size > 2176 ) pad_size = 3200;
		else if( pad_size > 1152 ) pad_size = 2176;
		else if( pad_size > 128 ) pad_size = 1152;
		else pad_size = 128;

		feature_id = 0xaa + (pad_size/1024);
		memcpy( eps->commandbuffer + pad_size - 4, &magic_go, 4 );
		eps->commandbuffer[0] = feature_id;
	}
	else
	{
		// Should never happen
		fprintf(stderr, "Error! Command buffer is bigger than scratchpad\n");
		return -10;
	}

