lopple/ch32fun/minichlink/pgm-b003fun.c
	#ifdef DEBUG_B003
	{
		int i;
		printf( "Commit TX: %lu bytes\n", pad_size  );
		for( i = 0; i < pad_size ; i++ )
		{
			printf( "%02x ", eps->commandbuffer[i] );
			if( ( i & 0xf ) == 0xf ) printf( "\n" );
		}
		if( ( i & 0xf ) != 0xf ) printf( "\n" );
	}
	#endif

resend:
	r = hid_send_feature_report( eps->hd, eps->commandbuffer, pad_size );
	#ifdef DEBUG_B003
	printf( "hid_send_feature_report = %d\n", r );
	#endif
	if( r < 0 )
	{
		if( retries ) fprintf( stderr, "Warning: Issue with hid_send_feature_report. Retrying: %d\n", retries );
		if( retries++ > 10 )
		{
			return r;
		}
		else
		{
			B003FunRetryDelayUS( eps->send_retry_delay_us );
			goto resend;
		}
	}

	if (eps->no_get_report) return r;

	// I thought I needed to go slower with new v006 bootloader, apparently I don't
	// Leaving this for now just in case, will remove later
	// if( !retries && (pad_size > 128) )
	// {
	// 	MCF.DelayUS( eps, pad_size*100 );
	// }
	// else if( eps->long_op > 1 )
	// {
	// 	MCF.DelayUS( eps, pad_size*100 );
	// }

	int timeout = 0;
	retries = 0;

	int max_retries = 10;
	int max_timeout = 20;
	if( eps->long_op )
	{
		fprintf(stderr, ".");
		max_retries = 100;
		max_timeout = 200;
	}

	if( eps->fixed_report_size )
	{
		pad_size = (uint32_t)eps->fixed_report_size;
		feature_id = 0xaa;
	}
	else if( receive_data_len ) {
		pad_size = receive_data_len + eps->commandplace + 4;

		if( pad_size <= eps->scratchpad_size )
		{
			if( pad_size > 5248 ) pad_size = 6272;
			else if( pad_size > 4096 ) pad_size = 5248;
			else if( pad_size > 3200 ) pad_size = 4096;
			else if( pad_size > 2176 ) pad_size = 3200;
			else if( pad_size > 1152 ) pad_size = 2176;
			else if( pad_size > 128 ) pad_size = 1152;
			else pad_size = 128;

			feature_id = 0xaa + (pad_size / 1024);
		}
		else
		{
			// Should never happen
			fprintf(stderr, "Error! Receive buffer is bigger than scratchpad\n");
			return -10;
		}
	}
	else
	{
		if( eps->no_eight_byte )
		{
			feature_id = 0xaa;
			pad_size = 128;
		}
		else
		{
			feature_id = 0xa8;
			pad_size = 8;
		}
	}

	do
	{
		eps->respbuffer[0] = feature_id;
		r = hid_get_feature_report( eps->hd, eps->respbuffer, pad_size );

		#ifdef DEBUG_B003
		{
			int i;
			printf( "Commit RX: %d bytes\n", r );
			for( i = 0; i < r; i++ )
			{
				printf( "%02x ", eps->respbuffer[i] );
				if( ( i & 0xf ) == 0xf ) printf( "\n" );
			}
			if( ( i & 0xf ) != 0xf ) printf( "\n" );
		}
		#endif

		if( r < 0 )
		{
			if( retries++ > max_retries ) {
				printf( "Error: CommitOp retries = %d\n", retries );
				return r;
			}
			if( eps->long_op ) MCF.DelayUS( eps, 5000 );
			continue;
		}

		if( eps->respbuffer[1] == 0xff ) break;

		if( timeout++ > max_timeout )
		{
			printf( "Error: Timed out waiting for stub to complete\n" );
			return -99;
		}

		if( eps->long_op ) MCF.DelayUS( eps, 5000 );
	} while( 1 );

	eps->long_op = 0;
	
	return 0;
}

static int B003FunFlushLLCommands( void * dev )
{
	// All commands are synchronous anyway.
	return 0;
}


static int B003FunWaitForDoneOp( void * dev, int ignore )
{
	// It's synchronous, so no issue here.
	return 0;
}

// static int B003FunDelayUS( void * dev, int microseconds )
// {
	// usleep( microseconds );
// 	return 0;
// }

// Does not handle erasing
static int InternalB003FunWriteBinaryBlob( void * dev, uint32_t address_to_write_to, uint32_t write_size, const uint8_t * blob )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;

	int is_flash = IsAddressFlash( address_to_write_to );

	if( ( address_to_write_to & 0x1 ) && write_size > 0 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_write_blob, sizeof(byte_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 1 ); // write 1 bytes.
		memcpy( &eps->commandbuffer[60], blob, 1 );
		if( CommitOp( eps, 1, 1) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 1 ) ) goto verifyfail;
		blob++;
		write_size --;
		address_to_write_to++;
	}
	if( ( address_to_write_to & 0x2 ) && write_size > 1 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_write_blob, sizeof(half_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 2 ); // write 2 bytes.
		memcpy( &eps->commandbuffer[60], blob, 2 );
		if( CommitOp( eps, 2, 2 ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 2 ) ) goto verifyfail;
		blob += 2;
		write_size -= 2;
		address_to_write_to+=2;
	}
	while( write_size > 3 )
	{
		int to_write_this_time = write_size & (~3);
		if( to_write_this_time > eps->scratchpad_data_size ) to_write_this_time = eps->scratchpad_data_size;

		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, word_wise_write_blob, sizeof(word_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, to_write_this_time ); // write 4 bytes.
		memcpy( &eps->commandbuffer[60], blob, to_write_this_time );
		if( CommitOp( eps, to_write_this_time, 0 ) ) return -5;
		// Not reading back, apparently
		// if( is_flash && memcmp( &eps->respbuffer[60], blob, to_write_this_time ) ) goto verifyfail;
		blob += to_write_this_time;
		write_size -= to_write_this_time;
		address_to_write_to += to_write_this_time;
	}
	if( write_size > 1 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_write_blob, sizeof(half_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 2 ); // write 2 bytes.
		memcpy( &eps->commandbuffer[60], blob, 2 );
		if( CommitOp( eps, 2, 2 ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 2 ) ) goto verifyfail;
		blob += 2;
		write_size -= 2;
		address_to_write_to += 2;
	}
	if( write_size )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_write_blob, sizeof(byte_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 1 ); // write 1 byte.
		memcpy( &eps->commandbuffer[60], blob, 1 );
		if( CommitOp( eps, 1, 1 ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 1 ) ) goto verifyfail;
		blob += 1;
		write_size -= 1;
		address_to_write_to+=1;
	}
	eps->long_op = 0;
	return 0;
verifyfail:
	fprintf( stderr, "Error: Write Binary Blob: %d bytes to %08x\n", write_size, address_to_write_to );
	return -6;
}

static int B003FunReadBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint8_t * blob )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;

