lopple/ch32fun/minichlink/pgm-b003fun.c
#ifdef DEBUG_B003
	printf( "Read Binary Blob: %d bytes from %08x\n", read_size, address_to_read_from );
#endif

	if( ( address_to_read_from & 0x1 ) && read_size > 0 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 bytes.
		if( CommitOp( eps, 0, 1 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob++;
		read_size --;
		address_to_read_from++;
	}
	if( ( address_to_read_from & 0x2 ) && read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps, 0, 2 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from+=2;
	}
	while( read_size > 3 )
	{
		int to_read_this_time = read_size & (~3);
		if( to_read_this_time > eps->scratchpad_data_size ) to_read_this_time = eps->scratchpad_data_size;

		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, word_wise_read_blob, sizeof(word_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, to_read_this_time ); // Read 4 bytes.
		if( CommitOp( eps, 0, to_read_this_time ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], to_read_this_time );
		blob += to_read_this_time;
		read_size -= to_read_this_time;
		address_to_read_from += to_read_this_time;
	}
	if( read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps, 0, 2 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from += 2;
	}
	if( read_size )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 byte.
		if( CommitOp( eps, 0, 1 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob += 1;
		read_size -= 1;
		address_to_read_from+=1;
	}
	return 0;
}

static int B003FunEnsureCrc32Loader( struct B003FunProgrammerStruct * eps )
{
	if( eps->crc32_loader_uploaded )
	{
		return 0;
	}

	int r = InternalB003FunWriteBinaryBlob( eps, B003FUN_CRC32_LOADER_ADDR, sizeof( ram_crc32 ), ram_crc32 );
	if( r )
	{
		return r;
	}
	eps->crc32_loader_uploaded = 1;
	return 0;
}

static int B003FunHashBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint32_t * crc32_out )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;
	uint64_t crc_start_ms = B003FunTimingNowMS();

	if( address_to_read_from < 0x01000000 )
	{
		address_to_read_from |= 0x08000000;
	}

	uint64_t loader_start_ms = B003FunTimingNowMS();
	int r = B003FunEnsureCrc32Loader( eps );
	B003FunTimingPrint( "crc_loader_upload", loader_start_ms );
	if( r )
	{
		return r;
	}

	ResetOp( eps );
	WriteOpArb( eps, call_crc32, sizeof( call_crc32 ) );
	memcpy( &eps->commandbuffer[B003FUN_CRC32_PARAM_OFFSET], &address_to_read_from, 4 );
	memcpy( &eps->commandbuffer[B003FUN_CRC32_PARAM_OFFSET + 4], &read_size, 4 );
	uint32_t loader_addr = B003FUN_CRC32_LOADER_ADDR;
	memcpy( &eps->commandbuffer[B003FUN_CRC32_PARAM_OFFSET + 8], &loader_addr, 4 );
	if( MCF.PrepForLongOp ) MCF.PrepForLongOp( eps );
	int send_len = B003FUN_CRC32_PARAM_OFFSET + 12 - eps->commandplace;
	int receive_len = B003FUN_CRC32_RESULT_OFFSET + 4 - eps->commandplace;
	uint64_t execute_start_ms = B003FunTimingNowMS();
	if( CommitOp( eps, send_len, receive_len ) ) return -5;
	B003FunTimingPrint( "crc_execute", execute_start_ms );

	memcpy( crc32_out, &eps->respbuffer[B003FUN_CRC32_RESULT_OFFSET], 4 );
	B003FunTimingPrint( "crc_total", crc_start_ms );
	return 0;
}
static int InternalB003FunBoot( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;

	printf( "Booting\n" );
	ResetOp( eps );
	WriteOpArb( eps, run_app_blob, sizeof(run_app_blob) );
	// for( int i = 0; i < 128; i++ )
	// {
	// 	printf( "%02x ", eps->commandbuffer[i] );
	// }
	// printf( "\n" );
	eps->no_get_report = 1;
	int boot_result = CommitOp( eps, 0, 0 );
	if( boot_result < 0 ) return -5;
	if( B003FunEnvEnabledDefault( "B003FUN_WAIT_USER_AFTER_BOOT", 1 ) )
	{
		int poll_ms = B003FunEnvInt( "B003FUN_USER_SCAN_POLL_MS", 50, 1, 1000 );
		int timeout_ms = B003FunEnvInt( "B003FUN_USER_SCAN_TIMEOUT_MS", 5000, 100, 30000 );
		uint32_t attempts = 0;
		uint64_t wait_start_ms = B003FunTimingNowMS();
		B003FunTimingPrintCount( "boot_user_wait_poll_ms", (uint32_t)poll_ms );
		B003FunTimingPrintCount( "boot_user_wait_timeout_ms", (uint32_t)timeout_ms );
		hid_close( eps->hd );
		eps->hd = 0;
		hid_device * user_hd = B003FunOpenUserVendorInterface( &attempts, poll_ms, timeout_ms );
		B003FunTimingPrintCount( "boot_user_wait_attempts", attempts );
		B003FunTimingPrint( "boot_user_wait", wait_start_ms );
		if( !user_hd ) return -6;
		hid_close( user_hd );
	}
	return 0;
}

static int B003FunSetupInterface( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = (struct InternalState*)(((struct B003FunProgrammerStruct*)eps)->internal);
	uint64_t setup_start_ms = B003FunTimingNowMS();
	iss->target_chip = &ch32v003;

	printf( "Halting Boot Countdown\n" );
	ResetOp( eps );
	WriteOpArb( eps, halt_wait_blob, sizeof(halt_wait_blob) );
	if( CommitOp( eps, 0, 0 ) ) return -5;

