lopple/ch32fun/minichlink/pgm-b003fun.c
	if( eps->fixed_report_size )
	{
		eps->no_eight_byte = 1;
		eps->scratchpad_size = eps->fixed_report_size;
		int max_payload_size = ( eps->fixed_report_size - 92 ) & ~63;
		if( max_payload_size >= 64 )
		{
			eps->scratchpad_data_size = B003FunEnvInt( "B003FUN_FORCE_PAYLOAD_SIZE", max_payload_size, 64, max_payload_size );
			eps->scratchpad_data_size &= ~63;
		}
	}
	else
	{
		// Check for minimum 8 byte feature
		eps->respbuffer[0] = 0xa8;
		int r = hid_get_feature_report( eps->hd, eps->respbuffer, 8 );
		if( r != 8 ) eps->no_eight_byte = 1;
		else eps->no_eight_byte = 0;
		// Check for the maximum buffer size available
		eps->respbuffer[0] = 0xad;
		// 4096 is the maximum size for windows and mac
		r = hid_get_feature_report( eps->hd, eps->respbuffer, 4096 );
		if( r >= 0 ) // If not on Windows, or guessed the first time
		{
			eps->scratchpad_size = r;
			// Check once more, if we can go higher
			// On windows and mac it will fail, on linux we will get an actual maximum HID report size
			eps->respbuffer[0] = 0xb0;
			r = hid_get_feature_report( eps->hd, eps->respbuffer, 6144+128 );
			if( r > eps->scratchpad_size ) eps->scratchpad_size = r;
		}
		else
		{
			for( int i = 0xac; i > 0xaa; i-- )
			{
				int id_size = 5120 - (1024*(0xaf - i)) + 128;
				eps->respbuffer[0] = i;
				r = hid_get_feature_report( eps->hd, eps->respbuffer, id_size );
				if( r == id_size )
				{
					eps->scratchpad_size = id_size;
					break;
				}
			}
		}
	}
	if( eps->scratchpad_size >= (128 + 1024) ) eps->scratchpad_data_size = eps->scratchpad_size - 128;
	B003FunTimingPrintCount( "scratchpad_size", (uint32_t)eps->scratchpad_size );
	B003FunTimingPrintCount( "scratchpad_data_size", (uint32_t)eps->scratchpad_data_size );

	uint32_t one;
	int two;
	uint8_t read_protection = 0;
	uint32_t chip_id = 0;
	MCF.ReadWord( dev, 0x4002201c, &one );
	MCF.ReadWord( dev, 0x40022020, (uint32_t*)&two );
	MCF.ReadWord( dev, 0x1ffff7c4, &chip_id );
	
	if( (one & 2) || two != -1 ) read_protection = 1;

	if( chip_id == 0xffffffff )
	{
		MCF.ReadWord( dev, 0x1ffff704, &chip_id );
		if( (chip_id & 0xfff00000) == 0x00200000 )
		{
			iss->target_chip = &ch32v002;
		}
		else if( (chip_id & 0xfff00000) == 0x00400000 )
		{
			iss->target_chip = &ch32v004;
		}
		else if( (chip_id & 0xfff00000) == 0x00500000 )
		{
			iss->target_chip = &ch32v005;
		}
		else if( (chip_id & 0xfff00000) == 0x00600000 )
		{
			iss->target_chip = &ch32v006;
		}
		else if( (chip_id & 0xfff00000) == 0x00700000 )
		{
			iss->target_chip = &ch32v007;
		}
	}

	iss->target_chip_id = chip_id;
	iss->target_chip_type = iss->target_chip->family_id;
	iss->flash_size = iss->target_chip->flash_size;
	iss->ram_base = iss->target_chip->ram_base;
	iss->ram_size = iss->target_chip->ram_size;
	iss->sector_size = iss->target_chip->sector_size;
	uint8_t * part_type = (uint8_t*)&iss->target_chip_id;
	uint8_t uuid[8];
	fprintf( stderr, "Detected %s\n", iss->target_chip->name_str );
	if( B003FunTimingEnabled() ) fprintf( stderr, "b003fast_hid_buffer=%d\n", eps->scratchpad_size );
	fprintf( stderr, "Flash Storage: %d kB\n", iss->flash_size/1024 );
	if( MCF.GetUUID( dev, uuid ) ) fprintf( stderr, "Couldn't read UUID\n" );
	else fprintf( stderr, "Part UUID: %02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x\n", uuid[0], uuid[1], uuid[2], uuid[3], uuid[4], uuid[5], uuid[6], uuid[7] );
	fprintf( stderr, "Part Type: %02x-%02x-%02x-%02x\n", part_type[3], part_type[2], part_type[1], part_type[0] );
	fprintf( stderr, "Read protection: %s\n", (read_protection > 0)?"enabled":"disabled" );
	B003FunTimingPrint( "setup", setup_start_ms );
	return 0;
}

static int B003FunExit( void * dev )
{
	return 0;
}

// MUST be 4-byte-aligned.
static int B003FunWriteWord( void * dev, uint32_t address_to_write, uint32_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 4, (uint8_t*)&data );
}

static int B003FunReadWord( void * dev, uint32_t address_to_read, uint32_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 4, (uint8_t*)data );
}

static int B003FunBlockWrite64( void * dev, uint32_t address_to_write, const uint8_t * data )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = eps->internal;

	if( IsAddressFlash( address_to_write ) )
	{
		if( !iss->flash_unlocked )
		{
			int rw;
			if( ( rw = InternalUnlockFlash( dev, iss ) ) )
				return rw;
		}

		if( !InternalIsMemoryErased( iss, address_to_write ) )
		{
			if( MCF.Erase( dev, address_to_write, 64, 0 ) )
			{
				fprintf( stderr, "Error: Failed to erase sector at %08x\n", address_to_write );
				return -9;
			}
		}

		// Not actually needed.
		MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG ); // (intptr_t)&FLASH->CTLR = 0x40022010
		MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG | CR_BUF_RST); // (intptr_t)&FLASH->CTLR = 0x40022010

		ResetOp( eps );
		WriteOpArb( eps, write64_flash, sizeof(write64_flash) );
		WriteOp4( eps, address_to_write ); // Base address to write. @52
		WriteOp4( eps, 0x4002200c ); // FLASH STATR base address. @ 56
		memcpy( &eps->commandbuffer[60], data, 64 ); // @60
		if( MCF.PrepForLongOp ) MCF.PrepForLongOp( dev );  // Give the programmer a headsup this next operation could take a while.
		if( CommitOp( eps, 64, 0 ) ) return -5;

	}
	else
	{
		return InternalB003FunWriteBinaryBlob( dev, address_to_write, 64, data );
	}

	return 0;
}

static int B003FunBlockErase( void * dev, uint32_t address_to_erase, uint32_t len )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = eps->internal;

	if( IsAddressFlash( address_to_erase ) )
	{
		if( !iss->flash_unlocked )
		{
			int rw;
			if( ( rw = InternalUnlockFlash( dev, iss ) ) )
				return rw;
		}

		ResetOp( eps );
		WriteOpArb( eps, erase_block_bin, sizeof(erase_block_bin) );
		WriteOp4( eps, address_to_erase ); // Base address to erase
		WriteOp4( eps, 0x4002200c ); // FLASH STATR base address
		WriteOp4( eps, (iss->sector_size | len << 16));
		eps->long_op = len;
		if( CommitOp( eps, 0, 0 ) ) return -5;

