lopple/ch32fun/minichlink/pgm-b003fun.c
		return 0;
	}

	// We can't write into flash when mapped to 0x00000000
	if( address_to_write < 0x01000000 ) {
		address_to_write |= 0x08000000;
		iss->current_area = PROGRAM_AREA;
	}

	int is_flash = IsAddressFlash( address_to_write );

	if( is_flash && !iss->flash_unlocked )
	{
		if( ( rw = InternalUnlockFlash( dev, iss ) ) )
			return rw;
	}

	if (iss->current_area == PROGRAM_AREA) {
		uint32_t sector_size = iss->target_chip->sector_size;

		if ((sector_size > 64) && (eps->scratchpad_size < 348)) {
			fprintf(stderr, "Can't write to flash, scratchpad size is to small.\n");
			return -10;
		}
		
		uint32_t spad = address_to_write - ((address_to_write / sector_size) * sector_size); // Size of data in the sector before the the address we are writing to
		uint32_t epad = (address_to_write + blob_size) - (((address_to_write + blob_size) / sector_size) * sector_size); // Size of the data in the start of the last sector we will be writing to
		if (spad + blob_size <= sector_size) epad = 0;

		uint32_t new_blob_size = blob_size + spad - epad + (epad?sector_size:0); // This will be a new blob size divisible by sector size

		uint8_t * new_blob = malloc(new_blob_size);
		memset(new_blob, 0, new_blob_size);

		uint32_t new_address = address_to_write - spad;
		
		if (spad || epad) {
			if (spad) {
				if (spad + blob_size <= sector_size) {
					MCF.ReadBinaryBlob(dev, (address_to_write - spad), sector_size, new_blob);
					epad = 0;
				} else {
					MCF.ReadBinaryBlob(dev, (address_to_write - spad), spad, new_blob);
				}
			}
			if (epad) {
				MCF.ReadBinaryBlob(dev, (address_to_write + blob_size), sector_size - epad, new_blob + spad + blob_size);
			}
		}

		memcpy(new_blob+spad, blob, blob_size);

		B003FunErase(dev, new_address, new_blob_size, 0);
		
		if (eps->scratchpad_size > 348 || ( eps->fixed_report_size && eps->scratchpad_data_size > 64 )) {
			ret = B003FunBlockWrite(dev, new_address, new_blob, new_blob_size);
			if(ret) {
				fprintf(stderr, "Error writing block at memory %08x / Error: %d\n", new_address, ret);
				return ret;
			}
		} else {
			for (int i = 0; i < new_blob_size/64; i++) {
				ret = B003FunBlockWrite64(dev, new_address + (i * 64), new_blob + (i*64));
				if(ret) {
					fprintf(stderr, "Error writing block at memory %08x / Error: %d\n", new_address + (i*64), ret);
					return ret;
				}
			}
		}
		free(new_blob);
	} else if (iss->current_area == RAM_AREA) {
		return InternalB003FunWriteBinaryBlob( dev, address_to_write, blob_size, blob );
	} else if (iss->current_area == BOOTLOADER_AREA) {
    fprintf(stderr, "Error. Can't write to boot area using bootloader.\n");
		ret = -3;
		goto end;
  } else {
		fprintf(stderr, "Unknown memory region. Not writing.\n");
		ret = -2;
		goto end;
	}
end:
	return ret;
}

static int B003FunWriteHalfWord( void * dev, uint32_t address_to_write, uint16_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 2, (uint8_t*)&data );
}

static int B003FunReadHalfWord( void * dev, uint32_t address_to_read, uint16_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 2, (uint8_t*)data );
}

static int B003FunWriteByte( void * dev, uint32_t address_to_write, uint8_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 1, &data );
}

static int B003FunReadByte( void * dev, uint32_t address_to_read, uint8_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 1, data );
}


static int B003FunHaltMode( void * dev, int mode )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	switch ( mode )
	{
	case HALT_MODE_HALT_BUT_NO_RESET: // Don't reboot.
	case HALT_MODE_HALT_AND_RESET:    // Reboot and halt
		// This programmer is always halted anyway.
		break;

	case HALT_MODE_REBOOT:            // Actually boot?
		return InternalB003FunBoot( dev );

	case HALT_MODE_RESUME:
		fprintf( stderr, "Warning: this programmer cannot resume\n" );
		// We can't do this.
		break;

	case HALT_MODE_GO_TO_BOOTLOADER:
		fprintf( stderr, "Warning: this programmer is already a bootloader.  Can't go into bootloader\n" );
		break;

	default:
		fprintf( stderr, "Error: Unknown halt mode %d\n", mode );
	}

	iss->processor_in_mode = mode;
	return 0;
}


int B003FunPrepForLongOp( void * dev )
{
	struct B003FunProgrammerStruct * d = (struct B003FunProgrammerStruct*)dev;
	d->long_op = 1;
	return 0;
}

int B003PollTerminal( void * dev, uint8_t * buffer, int maxlen, uint32_t leaveflagA, int leaveflagB )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)eps)->internal);
	int r;
	uint8_t rr;
	if( iss->statetag != STTAG( "TERM" ) )
	{
		iss->statetag = STTAG( "TERM" );
	}

	if( maxlen < 8 ) return -9;

	eps->respbuffer[0] = TERMINAL_FEATURE_ID;
	r = hid_get_feature_report( eps->hd, eps->respbuffer, 8 );

	if( (leaveflagA>>8) ) {
		memset( eps->commandbuffer, 0, 8 );
		*((uint32_t*)eps->commandbuffer) = leaveflagA;
		*((uint32_t*)eps->commandbuffer+1) = leaveflagB;
		eps->commandbuffer[0] = TERMINAL_FEATURE_ID;
		eps->commandbuffer[1] = (leaveflagA>>8) & 0xFF;
		r = hid_send_feature_report( eps->hd, eps->commandbuffer, 8 );
	}

#if MAX_USB_ERR
	if( r < 0 ) eps->err_count++;
	else eps->err_count = 0;

	if( eps->err_count > MAX_USB_ERR ) return -8;
#endif

	rr = eps->respbuffer[0];
	if( rr == TERMINAL_FEATURE_ID ) return -1;	// USB just ack'ed
	if( rr & 0x80 )
	{
		int num_printf_chars = (rr & 0xf)-4;
		memcpy( buffer, eps->respbuffer+1, num_printf_chars );
		*(buffer+num_printf_chars) = 0; //  For ease of mind make the buffer a C-string
		if( num_printf_chars <= 0 ) return num_printf_chars-1;
		return num_printf_chars;
	}
	else
	{
		return -1;
	}
}

static int B003FunGetUUID(void * dev, uint8_t * buffer)
{
	int ret = 0;
	uint8_t local_buffer[8] = {0, 0, 0, 0, 0, 0, 0, 0};

	ret |= MCF.ReadWord( dev, 0x1ffff7e8, (uint32_t*)local_buffer );			
	ret |= MCF.ReadWord( dev, 0x1ffff7ec, (uint32_t*)(local_buffer + 4) );
	
	*((uint32_t*)buffer) = local_buffer[0]<<24|local_buffer[1]<<16|local_buffer[2]<<8|local_buffer[3];
	*(((uint32_t*)buffer)+1) = local_buffer[4]<<24|local_buffer[5]<<16|local_buffer[6]<<8|local_buffer[7];
	return ret;
}

static hid_device * B003FunOpenBootloaderSettled( uint32_t bootloader_id )
{
	uint64_t reenum_start_ms = B003FunTimingNowMS();
	int settle_ms = B003FunEnvInt( "B003FUN_BOOTLOADER_SETTLE_MS", 50, 0, 1000 );
	int poll_ms = B003FunEnvInt( "B003FUN_BOOTLOADER_POLL_MS", 10, 1, 1000 );
	int timeout_ms = B003FunEnvInt( "B003FUN_BOOTLOADER_TIMEOUT_MS", 10000, 100, 30000 );
	uint32_t attempts = 0;

	B003FunTimingPrintCount( "bootloader_settle_ms", (uint32_t)settle_ms );
	B003FunTimingPrintCount( "bootloader_poll_ms", (uint32_t)poll_ms );
	B003FunTimingPrintCount( "bootloader_timeout_ms", (uint32_t)timeout_ms );
	while( B003FunTimingNowMS() - reenum_start_ms < (uint64_t)timeout_ms )
	{
		attempts++;
		hid_device * hd = hid_open( bootloader_id >> 16, bootloader_id & 0xffff, 0 );
		if( hd )
		{
			if( settle_ms ) usleep( settle_ms * 1000 );
			hid_close( hd );
			hd = hid_open( bootloader_id >> 16, bootloader_id & 0xffff, 0 );
			if( hd )
			{
				B003FunTimingPrintCount( "bootloader_reenum_attempts", attempts );
				B003FunTimingPrint( "bootloader_reenum", reenum_start_ms );
				return hd;
			}
		}
		usleep( poll_ms * 1000 );
	}
	B003FunTimingPrintCount( "bootloader_reenum_attempts", attempts );
	B003FunTimingPrint( "bootloader_reenum", reenum_start_ms );
	return 0;
}

