lopple/ch32fun/minichlink/pgm-b003fun.c
static hid_device * B003FunOpenUserVendorInterface( uint32_t * attempts_out, int poll_ms, int timeout_ms )
{
	hid_device * user_hd = 0;
	uint32_t attempts = 0;
	uint64_t scan_start_ms = B003FunTimingNowMS();
	while( !user_hd && B003FunTimingNowMS() - scan_start_ms < (uint64_t)timeout_ms )
	{
		attempts++;
		struct hid_device_info * devs = hid_enumerate( B003FUN_FAST_USER_VIDPID >> 16, B003FUN_FAST_USER_VIDPID & 0xffff );
		struct hid_device_info * cur;
		for( cur = devs; cur; cur = cur->next )
		{
			if( cur->usage_page == 0xff00 )
			{
				user_hd = hid_open_path( cur->path );
				break;
			}
		}
		hid_free_enumeration( devs );
		if( !user_hd ) usleep( poll_ms * 1000 );
	}
	if( attempts_out ) *attempts_out = attempts;
	return user_hd;
}

static hid_device * B003FunTryUserFeatureBootReset( uint32_t bootloader_id )
{
	uint32_t user_scan_attempts = 0;
	uint64_t scan_start_ms = B003FunTimingNowMS();
	int poll_ms = B003FunEnvInt( "B003FUN_USER_SCAN_POLL_MS", 50, 1, 1000 );
	int timeout_ms = B003FunEnvInt( "B003FUN_USER_SCAN_TIMEOUT_MS", 5000, 100, 30000 );

	B003FunTimingPrintCount( "user_scan_poll_ms", (uint32_t)poll_ms );
	B003FunTimingPrintCount( "user_scan_timeout_ms", (uint32_t)timeout_ms );
	hid_device * user_hd = B003FunOpenUserVendorInterface( &user_scan_attempts, poll_ms, timeout_ms );
	B003FunTimingPrintCount( "user_scan_attempts", user_scan_attempts );
	B003FunTimingPrint( "user_scan", scan_start_ms );
	if( !user_hd ) return 0;

	fprintf( stderr, "Trying to reboot user firmware into bootloader\n" );
	uint8_t buffer[8] = { 0 };
	uint64_t reset_feature_start_ms = B003FunTimingNowMS();
	hid_get_feature_report( user_hd, buffer, sizeof( buffer ) );
	B003FunTimingPrint( "user_reset_feature", reset_feature_start_ms );
	hid_close( user_hd );

	fprintf( stderr, "Waiting for bootloader HID re-enumeration\n" );
	return B003FunOpenBootloaderSettled( bootloader_id );
}

void * TryInit_B003Fun(uint32_t id)
{
	hid_init();
	fprintf( stderr, "VID:0x%04x, PID:0x%04x\n", id>>16, id&0xFFFF );
	hid_device * hd = hid_open( id>>16, id&0xFFFF, 0); // third parameter is "serial"
	if( !hd && id == B003FUN_FAST_TEST_VIDPID )
	{
		hd = B003FunTryUserFeatureBootReset( id );
	}
	if( !hd ) {
		hd = hid_open(0x1209, 0xd003, 0);	//	Looking for default rv003usb device
		if (!hd) {
			return 0;
		} else {
			fprintf( stderr, "Trying to reboot into bootloader\n");
			uint8_t buffer[7] = { 0xfd, 0x12, 0x34, 0xaa, 0xbb, 0xcc, 0xdd };
			hid_send_feature_report(hd, buffer, sizeof(buffer));	// Sending magic soft reboot command
			fprintf( stderr, "Sent magic packet\n");
			memset(buffer, 0, 7);
			int r2 = hid_get_feature_report(hd, buffer, 7);
			// I wish we had a better way to know if target understands our magic command
			if (r2 < 0) {
				for (int i = 0; i < 5; i++) {
					hd = hid_open( id>>16, id&0xFFFF, 0);
					if (hd) break;
					sleep(1);
				}
			}
			// hd = hid_open( id>>16, id&0xFFFF, 0);
			if (!hd) return 0;
		}
	}

	//extern int g_hidapiSuppress;
	//g_hidapiSuppress = 1;  // Suppress errors for this device.  (don't do this yet)

	struct B003FunProgrammerStruct * eps = malloc( sizeof( struct B003FunProgrammerStruct ) );
	memset( eps, 0, sizeof( *eps ) );
	eps->hd = hd;
	eps->commandplace = 1;
	eps->scratchpad_size = 128;
	eps->scratchpad_data_size = 64;
	eps->no_eight_byte = 1;
	if( id == B003FUN_FAST_TEST_VIDPID )
	{
		eps->fixed_report_size = B003FunEnvInt( "B003FUN_FORCE_REPORT_SIZE", 340, 0, 8196 );
	}
	eps->send_retry_delay_us = B003FunEnvInt( "B003FUN_SEND_RETRY_DELAY_US", 2000, 0, 50000 );
	B003FunTimingPrintCount( "fixed_report_size", (uint32_t)eps->fixed_report_size );
	B003FunTimingPrintCount( "send_retry_delay_us", (uint32_t)eps->send_retry_delay_us );
	memset( &MCF, 0, sizeof( MCF ) );
	MCF.WriteReg32 = 0;
	MCF.ReadReg32 = 0;
	MCF.FlushLLCommands = B003FunFlushLLCommands;
	// MCF.DelayUS = B003FunDelayUS;
	MCF.Control3v3 = 0;
	MCF.SetupInterface = B003FunSetupInterface;
	MCF.Exit = B003FunExit;
	MCF.HaltMode = 0;
	MCF.VoidHighLevelState = 0;
	MCF.PollTerminal = B003PollTerminal;

	// These are optional. Disabling these is a good mechanism to make sure the core functions still work.
	
	MCF.WriteWord = B003FunWriteWord;
	MCF.ReadWord = B003FunReadWord;

	MCF.WriteHalfWord = B003FunWriteHalfWord;
	MCF.ReadHalfWord = B003FunReadHalfWord;

	MCF.WriteByte = B003FunWriteByte;
	MCF.ReadByte = B003FunReadByte;

	MCF.WaitForDoneOp = B003FunWaitForDoneOp;
	MCF.BlockWrite64 = B003FunBlockWrite64;
	MCF.WriteBinaryBlob = B003FunWriteBinaryBlob;
	MCF.ReadBinaryBlob = B003FunReadBinaryBlob;
	MCF.HashBinaryBlob = B003FunHashBinaryBlob;
	MCF.Erase = B003FunErase;

	MCF.PrepForLongOp = B003FunPrepForLongOp;

	MCF.HaltMode = B003FunHaltMode;

	MCF.GetUUID = B003FunGetUUID;

	return eps;
}





// Utility for generating bootloader code:

// make rv003usb.bin &&  xxd -i -s 100 -l 44 rv003usb.bin

/*
// Read data, arbitrarily from memory. (byte-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LBU(a3, a1, 0);	//lbu a3, 0(a1)       // Read from RAM
	XW_C_SB(a3, a4, 0);		//sb a3, 0(a4)       // Store into scratchpad
	c.addi a1, 1        // Advance pointers
	c.addi a4, 1
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0,0
*/

/*
// Read data, arbitrarily from memory. (half-wise)

. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LHU(a3, a1, 0);	//lhu a3, 0(a1)       // Read from RAM
	XW_C_SH(a3, a4, 0);		//sh a3, 0(a4)       // Store into scratchpad
	c.addi a1, 2        // Advance pointers
	c.addi a4, 2
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0,0
*/

